In [1]:
import pandas as pd

In [2]:
df_order_items = pd.read_csv('..\data\postgresql_order_items_exported.csv')
df_orders = pd.read_csv('..\data\postgresql_orders_exported.csv')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Rirhc\AppData\Local\Temp\ipykernel_26956\3016496072.py:1: SyntaxWarning: invalid escape sequence '\d'
  df_order_items = pd.read_csv('..\data\postgresql_order_items_exported.csv')
C:\Users\Rirhc\AppData\Local\Temp\ipykernel_26956\3016496072.py:2: SyntaxWarning: invalid escape sequence '\d'
  df_orders = pd.read_csv('..\data\postgresql_orders_exported.csv')

In [3]:
df_orders.head()

,order_id,platform_name,order_date,customer_name,total_amount,platform_fee,net_payout,created_at
0,581429164508022658,Tiktok,2025-11-30 22:10:11,NaN,560.0,NaN,NaN,2025-12-17 17:58:44.083279
1,581429039833646412,Tiktok,2025-11-30 22:00:47,NaN,900.0,NaN,NaN,2025-12-17 17:58:44.083279
2,581428988188591518,Tiktok,2025-11-30 22:00:46,NaN,1026.0,NaN,NaN,2025-12-17 17:58:44.083279
3,581428226691531960,Tiktok,2025-11-30 21:05:08,NaN,2180.0,NaN,NaN,2025-12-17 17:58:44.083279
4,581427893682800518,Tiktok,2025-11-30 20:50:01,NaN,1460.0,NaN,NaN,2025-12-17 17:58:44.083279

In [4]:
df_order_items.head()

,id,order_id,selling_sku_id,platform_sku_original,quantity,unit_price,subtotal
0,3001,581429164508022658,001-IRC-MAXING-TT-22517-SET,1731556516994386609,1,560.0,560.0
1,3002,581429039833646412,001-IRC-MAXING-TT-20017-001,1731556500936034993,1,427.0,427.0
2,3003,581429039833646412,001-IRC-MAXING-TT-22517-001,1731556500936100529,1,473.0,473.0
3,3004,581428988188591518,001-IRC-MAXING-TT-20017-SET,1731556516994321073,2,513.0,1026.0
4,3005,581428226691531960,001-IRC-NR87-TL-908014-CLICK150I,1731556604016298673,1,1000.0,1000.0

In [5]:
df_orders.info()
df_order_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1849 entries, 0 to 1848
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1849 non-null   int64
 1   platform_name  1849 non-null   object
 2   order_date     1849 non-null   object
 3   customer_name  0 non-null      float64
 4   total_amount   1849 non-null   float64
 5   platform_fee   0 non-null      float64
 6   net_payout     0 non-null      float64
 7   created_at     1849 non-null   object
dtypes: float64(4), int64(1), object(3)
memory usage: 115.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2536 entries, 0 to 2535
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     2536 non-null   int64
 1   order_id               2536 non-null   int64
 2   selling_sku_id         2536 non-null   object
 3   platform_sku_original  2536 non-null   object
 4   quantity               2536 non-null   int64
 5   unit_price             2536 non-null   float64
 6   subtotal               2536 non-null   float64
dtypes: float64(2), int64(3), object(2)
memory usage: 138.8+ KB